In [105]:
import pandas as pd

In [106]:
df = pd.read_csv("titanic.csv")

In [107]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [108]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [109]:
y = df.Survived
x = df.drop('Survived',axis='columns')

In [110]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [111]:
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [112]:
dummies = pd.get_dummies(x.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [113]:
x = pd.concat([x,dummies],axis='columns')
x.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [114]:
x.columns[x.isna().any()]

Index(['Age'], dtype='object')

In [115]:
x.drop('Sex',axis='columns',inplace=True)
x.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [116]:
x.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [132]:
x.Age = x.Age.fillna(x.Age.mean())
x.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [133]:
x.columns[x.isna().any()]

Index([], dtype='object')

In [119]:
from sklearn.model_selection import train_test_split

In [120]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2)

In [121]:
len(x_train)

712

In [122]:
len(x_test)

179

In [123]:
len(x)

891

In [124]:
x_train

     Pclass        Age      Fare  female  male
359       3  29.699118    7.8792       1     0
784       3  25.000000    7.0500       0     1
382       3  32.000000    7.9250       0     1
689       1  15.000000  211.3375       1     0
524       3  29.699118    7.2292       0     1
..      ...        ...       ...     ...   ...
487       1  58.000000   29.7000       0     1
184       3   4.000000   22.0250       1     0
627       1  21.000000   77.9583       1     0
132       3  47.000000   14.5000       1     0
825       3  29.699118    6.9500       0     1

[712 rows x 5 columns]

In [125]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [126]:
model.fit(x_train,y_train)

GaussianNB()

In [127]:
model.score(x_test,y_test)

0.776536312849162

In [135]:
x_test[:10]

     Pclass        Age     Fare  female  male
457       1  29.699118  51.8625       1     0
530       2   2.000000  26.0000       1     0
535       2   7.000000  26.2500       1     0
182       3   9.000000  31.3875       0     1
590       3  35.000000   7.1250       0     1
601       3  29.699118   7.8958       0     1
2         3  26.000000   7.9250       1     0
197       3  42.000000   8.4042       0     1
826       3  29.699118  56.4958       0     1
90        3  29.000000   8.0500       0     1

In [129]:
y_test[:10]

457    1
530    1
535    1
182    0
590    0
601    0
2      1
197    0
826    0
90     0
Name: Survived, dtype: int64

In [130]:
model.predict(x_test[:10])

array([1, 1, 1, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [131]:
model.predict_proba(x_test[:10])

array([[0.00446219, 0.99553781],
       [0.00839565, 0.99160435],
       [0.01067456, 0.98932544],
       [0.97946792, 0.02053208],
       [0.98923587, 0.01076413],
       [0.98885601, 0.01114399],
       [0.03837817, 0.96162183],
       [0.98917325, 0.01082675],
       [0.98086602, 0.01913398],
       [0.98877287, 0.01122713]])